Revit 2026 API

# IFCExtrusionData Class

---

Represents the geometry of an extrusion (a solid body or opening) generated from Revit geometry.

SystemObject Autodesk.Revit.DB.IFCIFCExtrusionData

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCExtrusionData : IDisposable
```
```vb
Public Class IFCExtrusionData
	Implements IDisposable
```
```cpp
public ref class IFCExtrusionData : IDisposable
```
```fsharp
type IFCExtrusionData =
    class
        interface IDisposable
    end
```

The IFCExtrusionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCExtrusionData | Constructs a new empty extrusion data object. |

|  | Name | Description |
| --- | --- | --- |
|  | ExtrusionBasis | The basis used for the extrusion. |
|  | ExtrusionDirection | The direction used for the extrusion. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ScaledExtrusionLength | The length of the extrusion, scaled in the units of the export. |

|  | Name | Description |
| --- | --- | --- |
|  | AddLoop | Adds a curve loop to the extrusion data. |
|  | ClearLoops | Clears the curve loops stored in the extrusion data. |
|  | Dispose | Releases all resources used by the IFCExtrusionData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLoops | Gets the curve loops that form the base shape of the extrusion. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Determines if the extrusion data represents a valid extrusion. |
|  | RemoveLoopAt | Removes the loop at the specified index. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.IFC Namespace